stm32duino/Arduino_Core_STM32/system/Drivers/STM32WL3x_HAL_Driver/Inc/stm32wl3x_hal_adc.h
/**
  ******************************************************************************
  * @file    stm32wl3x_hal_adc.h
  * @author  GPM Application Team
  * @brief   Header file of ADC HAL module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32WL3x_HAL_ADC_H
#define STM32WL3x_HAL_ADC_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/

/* Include low level driver */
#include "stm32wl3x_ll_adc.h"

/** @addtogroup STM32WL3x_HAL_Driver
  * @{
  */

/** @addtogroup ADC
  * @{
  */

/* Exported types ------------------------------------------------------------*/
/** @defgroup ADC_Exported_Types ADC Exported Types
  * @{
  */

/**
  * @brief  Structure definition for the configuration of the ADC watchdog.
  */
typedef struct
{
  uint32_t LowThreshold;              /*!< Set the lower threshold for the watchdog.
                                           This parameter is a 12-bit value.  */

  uint32_t HighThreshold;             /*!< Set the higher threshold for the watchdog.
                                           This parameter is a 12-bit value.  */

  uint32_t ChannelMask;               /*!< Select the input channels the watchdog has to use.
                                           This parameter can be a value of @ref ADC_AWD_CHANNEL.  */

  uint32_t EventType;                 /*!< Select the event type used for the watchdog.
                                           This parameter can be a value of @ref ADC_AWD_EVENTTYPE.  */

} ADC_AnalogWDGConfTypeDef;

/**
  * @brief Structure definition with the setting for the Calibration Point().
  */
typedef struct
{
  uint32_t Number;                    /*!< Select the calibration point number
                                           This parameter can be a value of @ref ADC_HAL_CALIB_POINT
                                           Caution: Only one offset is allowed per input mode (Single positive, single
                                                    negative and differential) and voltage range. This parameter
                                                    overwrites the last setting.
                                           Note: Use the ADC_CALIB_NONE to skip calibration parameter for this channel
                                                 and leave offset and gain untouched. */

  uint32_t Offset;                    /*!< Define the offset to be subtracted from the raw converted data.
                                           Offset value must be a positive number.
                                           This parameter must be a number between Min_Data = 0x00 and
                                           Max_Data = 0xFF.  */

  uint32_t Gain;                      /*!< Specify the ADC gain compensation coefficient to be applied to ADC raw
                                           conversion data, based on following formula:
                                           DATA = DATA(raw) * (gain compensation coef) / 4096
                                           This parameter value can be:
                                            - value "0": Gain will be set to default parameters
                                            - value in range [0x001; 0xFFF]: Gain compensation will be set to specified
                                           value */

} ADC_CalibrationPointTypeDef;

/**
  * @brief  Structure definition for the configuration of the ADC watchdog.
  */
typedef struct
{
  uint32_t Channel;                              /*!< Specify the channel type the channel number code for the 1st
                                                      conversion of the sequence.
                                                      This parameter can be a value of @ref ADC_HAL_CH_NUM_CODE. */

  uint32_t Rank;                                 /*!< Assign a specific sequence number to the channel.
                                                      This parameter can be a value of @ref ADC_HAL_EC_SEQ_RANKS. */

  uint32_t VoltRange;                            /*!< Specify the voltage range for the selected channel.
                                                      This parameter can be a value of
                                                      @ref ADC_HAL_INPUT_VOLTAGE_RANGE. */

  ADC_CalibrationPointTypeDef CalibrationPoint;  /*!< Specify the calibration parameter for the selected channel. */

} ADC_ChannelConfTypeDef;

/**
  * @brief Structure definition with the setting for the Down Sampler (DS).
  */
typedef struct
{
  uint32_t    DataWidth;              /*!< Specify the width of the output data from the Down Sampler (DS).
                                           This parameter can be a value of @ref ADC_HAL_DS_DATA_WIDTH. */

  uint32_t    DataRatio;              /*!< Specify the ratio of the output data from the Down Sampler (DS).
                                           This parameter can be a value of @ref ADC_HAL_DS_RATIO. */

} ADC_DSConfTypeDef;

/**
  * @brief Structure definition with common setting for the ADC.
  */
typedef struct
{
  FunctionalState ContinuousConvMode;  /*!< Specify whether the conversion is performed in single mode (one conversion)
                                            or continuous mode for ADC group regular, after the first ADC conversion
                                            start trigger occurred (software start or external trigger). This parameter
                                            can be set to ENABLE or DISABLE. */

  uint32_t    SequenceLength;          /*!< Specify the length of the conversion sequence.
                                            This parameter must be a number between Min_Data = 1 and
                                            Max_Data = 16. */

