stm32duino/Arduino_Core_STM32/system/Drivers/STM32WL3x_HAL_Driver/Inc/stm32wl3x_hal_adc.h
  uint32_t    SamplingMode;            /*!< Specifies the input sampling mode.
                                            This parameter can be a value of @ref ADC_HAL_SAMPLING_METHOD. */

  uint32_t    SampleRate;              /*!< Specify the ADC sample rate.
                                            This parameter can be a value of @ref ADC_HAL_SAMPLE_RATE.     */

  ADC_DSConfTypeDef DownSamplerConfig; /*!< Specifies the Down Sampler parameters. */

  uint32_t    InvertOutputMode;        /*!< Specifies the bit to bit inversion (1' complement) for
                                            differential input and/or single negative input.
                                            This parameter can be a value of @ref ADC_HAL_DATA_INVERT.   */

  uint32_t    Overrun;                 /*!< Specifies the overrung policy applied to the data.
                                            This parameter can be a value of @ref ADC_HAL_OVERRUN_CONFIG.  */


} ADC_InitTypeDef;

/**
  * @brief  ADC handle Structure definition
  */
#if (USE_HAL_ADC_REGISTER_CALLBACKS == 1)
typedef struct __ADC_HandleTypeDef
#else
typedef struct
#endif /* USE_HAL_ADC_REGISTER_CALLBACKS */
{
  ADC_TypeDef        *Instance;    /*!< Register base address */
  ADC_InitTypeDef    Init;         /*!< Parameters for ADC initialization */

  DMA_HandleTypeDef  *DMA_Handle;  /*!< Pointer DMA Handler */

  HAL_LockTypeDef    Lock;         /*!< ADC locking object */
  __IO uint32_t      State;        /*!< ADC communication state (bitmap of ADC states) */
  __IO uint32_t      ErrorCode;    /*!< ADC Error code */

#if (USE_HAL_ADC_REGISTER_CALLBACKS == 1)
  void (* ConvCpltCallback)(struct __ADC_HandleTypeDef *hadc);         /*!< ADC conversion complete callback */
  void (* ConvHalfCpltCallback)(struct __ADC_HandleTypeDef *hadc);     /*!< ADC conversion DMA half-transfer callback */
  void (* LevelOutOfWindowCallback)(struct __ADC_HandleTypeDef *hadc); /*!< ADC analog watchdog 1 callback */
  void (* ErrorCallback)(struct __ADC_HandleTypeDef *hadc);            /*!< ADC error callback */
  void (* MspInitCallback)(struct __ADC_HandleTypeDef *hadc);          /*!< ADC Msp Init callback */
  void (* MspDeInitCallback)(struct __ADC_HandleTypeDef *hadc);        /*!< ADC Msp DeInit callback */
#endif /* USE_HAL_ADC_REGISTER_CALLBACKS */

} ADC_HandleTypeDef;


#if (USE_HAL_ADC_REGISTER_CALLBACKS == 1)
/**
  * @brief  HAL ADC Callback ID enumeration definition
  */
typedef enum
{
  HAL_ADC_CONVERSION_COMPLETE_CB_ID     = 0x00U,  /*!< ADC conversion complete callback ID          */
  HAL_ADC_CONVERSION_HALF_CB_ID         = 0x01U,  /*!< ADC conversion DMA half-transfer callback ID */
  HAL_ADC_LEVEL_OUT_OF_WINDOW_1_CB_ID   = 0x02U,  /*!< ADC watchdog callback ID                 */
  HAL_ADC_ERROR_CB_ID                   = 0x03U,  /*!< ADC error callback ID                        */
  HAL_ADC_MSPINIT_CB_ID                 = 0x09U,  /*!< ADC Msp Init callback ID                     */
  HAL_ADC_MSPDEINIT_CB_ID               = 0x0AU   /*!< ADC Msp DeInit callback ID                   */
} HAL_ADC_CallbackIDTypeDef;

/**
  * @brief  HAL ADC Callback pointer definition
  */
typedef  void (*pADC_CallbackTypeDef)(ADC_HandleTypeDef *hadc); /*!< pointer to a ADC callback function */

#endif /* USE_HAL_ADC_REGISTER_CALLBACKS */

/**
  * @}
  */


/* Exported constants --------------------------------------------------------*/

/** @defgroup ADC_Exported_Constants ADC Exported Constants
  * @{
  */

/** @defgroup ADC_States ADC States
  * @{
  */

/**
  * @brief  HAL ADC state machine: ADC states definition (bitfields)
  * @note   ADC state machine is managed by bitfields, state must be compared
  *         with bit by bit.
  *         For example:
  *           " if ((HAL_ADC_GetState(hadc) & HAL_ADC_STATEBUSY) != 0UL) "
  *           " if ((HAL_ADC_GetState(hadc) & HAL_ADC_STATE_AWD1) != 0UL) "
  */
/* States of ADC global scope */
#define HAL_ADC_STATE_RESET           (0x00000000UL)   /*!< ADC not yet initialized or disabled */
#define HAL_ADC_STATE_READY           (0x00000001UL)   /*!< ADC peripheral ready to use         */
#define HAL_ADC_STATE_BUSY_INTERNAL   (0x00000002UL)   /*!< ADC is busy due to an internal process (initialization, calibration) */
#define HAL_ADC_STATE_TIMEOUT         (0x00000004UL)   /*!< TimeOut occurrence                  */

/* States of ADC errors */
#define HAL_ADC_STATE_ERROR_INTERNAL  (0x00000010UL)   /*!< Internal error occurrence      */
#define HAL_ADC_STATE_ERROR_CONFIG    (0x00000020UL)   /*!< Configuration error occurrence */
#define HAL_ADC_STATE_ERROR_DMA       (0x00000040UL)   /*!< DMA error occurrence           */

/* States of ADC conversion */
#define HAL_ADC_STATE_DS_BUSY         (0x00000100UL)   /*!< A conversion on down sampler data path is ongoing or can
                                                            occur */
#define HAL_ADC_STATE_DS_EOC          (0x00000200UL)   /*!< Converted data available in downsampler data register     */
#define HAL_ADC_STATE_DS_OVR          (0x00000400UL)   /*!< Overrun on down sampler data path occurrence              */


/* States of ADC analog watchdog */
#define HAL_ADC_STATE_AWD1            (0x00010000UL)   /*!< Out-of-window occurrence of ADC analog watchdog */

/**
  * @}
  */


/** @defgroup ADC_Error_Code ADC Error Code
  * @{
  */

#define HAL_ADC_ERROR_NONE            (0x00U)   /*!< No error               */
#define HAL_ADC_ERROR_INTERNAL        (0x01U)   /*!< Internal error         */
#define HAL_ADC_ERROR_OVR             (0x02U)   /*!< Data overrun error     */
#define HAL_ADC_ERROR_DMA             (0x04U)   /*!< DMA transfer error     */

#if (USE_HAL_ADC_REGISTER_CALLBACKS == 1)
#define HAL_ADC_ERROR_INVALID_CALLBACK  (0x10U) /*!< Invalid Callback error */
#endif /* USE_HAL_ADC_REGISTER_CALLBACKS */

/**
  * @}
  */

#define ADC_DEFAULT_LDO_DELAY_US         (160UL)      /*!< Default delay for LDO stabilization (uS)*/

/** @defgroup ADC_HAL_CH_NUM_CODE ADC channel number code for conversion definitions
  * @{
  */

#define ADC_CHANNEL_VINM0            (LL_ADC_CHANNEL_VINM0)        /*!< ADC channel for VINM0 to single negative input */
#define ADC_CHANNEL_VINM1            (LL_ADC_CHANNEL_VINM1)        /*!< ADC channel for VINM1 to single negative input */
#define ADC_CHANNEL_VINM2            (LL_ADC_CHANNEL_VINM2)        /*!< ADC channel for VINM2 to single negative input */
#define ADC_CHANNEL_VINM3            (LL_ADC_CHANNEL_VINM3)        /*!< ADC channel for VINM3 to single negative input */
#define ADC_CHANNEL_VINP0            (LL_ADC_CHANNEL_VINP0)        /*!< ADC channel for VINP0 to single positive input */
#define ADC_CHANNEL_VINP1            (LL_ADC_CHANNEL_VINP1)        /*!< ADC channel for VINP1 to single positive input */
#define ADC_CHANNEL_VINP2            (LL_ADC_CHANNEL_VINP2)        /*!< ADC channel for VINP2 to single positive input */
#define ADC_CHANNEL_VINP3            (LL_ADC_CHANNEL_VINP3)        /*!< ADC channel for VINP3 to single positive input */
#define ADC_CHANNEL_VINP0_VINM0      (LL_ADC_CHANNEL_VINP0_VINM0)  /*!< ADC channel for VINP0 - VINM0 to differential input */
#define ADC_CHANNEL_VINP1_VINM1      (LL_ADC_CHANNEL_VINP1_VINM1)  /*!< ADC channel for VINP1 - VINM1 to differential input */
#define ADC_CHANNEL_VINP2_VINM2      (LL_ADC_CHANNEL_VINP2_VINM2)  /*!< ADC channel for VINP2 - VINM2 to differential input */
#define ADC_CHANNEL_VINP3_VINM3      (LL_ADC_CHANNEL_VINP3_VINM3)  /*!< ADC channel for VINP3 - VINM3 to differential input */
#define ADC_CHANNEL_VBAT             (LL_ADC_CHANNEL_VBAT)         /*!< ADC channel for VBAT, battery level detector        */
#define ADC_CHANNEL_TEMPSENSOR       (LL_ADC_CHANNEL_TEMPSENSOR)   /*!< ADC channel for temperature sensor                  */

/**
  * @}
  */

/** @defgroup ADC_HAL_SAMPLING_METHOD  ADC input sampling method definitions
  * @{
  */

