stm32duino/Arduino_Core_STM32/system/Drivers/STM32WL3x_HAL_Driver/Inc/stm32wl3x_hal_adc.h
#define ADC_SAMPLING_AT_START    (LL_ADC_SAMPLING_AT_START)  /*!< Sampling only at conversion start (default) */
#define ADC_SAMPLING_AT_END      (LL_ADC_SAMPLING_AT_END)    /*!< Sampling sampling phase starts after end of
                                                                  conversion, and stops upon trigger event
                                                                  (Also known as Bulb sampling mode). */

/**
  * @}
  */


/** @defgroup ADC_HAL_OVERRUN_CONFIG ADC overrun configuration definitions
  * @{
  */
#define ADC_NEW_DATA_IS_LOST    (LL_ADC_NEW_DATA_IS_LOST)        /*!< Previous data is preserved, new data is lost.   */
#define ADC_NEW_DATA_IS_KEPT    (LL_ADC_NEW_DATA_IS_KEPT)        /*!< Previous data is overwritten, new data is kept. */

/**
  * @}
  */


/** @defgroup ADC_HAL_DATA_INVERT ADC invert bit to bit data output for differential or
  *           single negative input (1' complement) definitions
  * @{
  */

#define ADC_DATA_INVERT_NONE  (0x00UL)    /*!< No inversion                             */
#define ADC_DATA_INVERT_DIFF  (0x01UL)    /*!< Inversion only for differential input    */
#define ADC_DATA_INVERT_SING  (0x02UL)    /*!< Inversion only for single negative input */
#define ADC_DATA_INVERT_BOTH  (0x03UL)    /*!< Inversion for both input type            */

/**
  * @}
  */

/** @defgroup ADC_HAL_SAMPLE_RATE ADC sample rate definitions
  * @{
  */
#define ADC_SAMPLE_RATE_16    (LL_ADC_SAMPLE_RATE_16)                     /*!< ADC conversion rate at F_ADC_CLK /  16 */
#define ADC_SAMPLE_RATE_20    (LL_ADC_SAMPLE_RATE_20)                     /*!< ADC conversion rate at F_ADC_CLK /  20 */
#define ADC_SAMPLE_RATE_24    (LL_ADC_SAMPLE_RATE_24)                     /*!< ADC conversion rate at F_ADC_CLK /  24 */
#define ADC_SAMPLE_RATE_28    (LL_ADC_SAMPLE_RATE_28)                     /*!< ADC conversion rate at F_ADC_CLK /  28 */
#define ADC_SAMPLE_RATE_32    (LL_ADC_SAMPLE_RATE_32)                     /*!< ADC conversion rate at F_ADC_CLK /  32 */
#define ADC_SAMPLE_RATE_36    (LL_ADC_SAMPLE_RATE_36)                     /*!< ADC conversion rate at F_ADC_CLK /  36 */
#define ADC_SAMPLE_RATE_40    (LL_ADC_SAMPLE_RATE_40)                     /*!< ADC conversion rate at F_ADC_CLK /  40 */
#define ADC_SAMPLE_RATE_44    (LL_ADC_SAMPLE_RATE_44)                     /*!< ADC conversion rate at F_ADC_CLK /  44 */
#define ADC_SAMPLE_RATE_48    (LL_ADC_SAMPLE_RATE_48)                     /*!< ADC conversion rate at F_ADC_CLK /  48 */
#define ADC_SAMPLE_RATE_52    (LL_ADC_SAMPLE_RATE_52)                     /*!< ADC conversion rate at F_ADC_CLK /  52 */
#define ADC_SAMPLE_RATE_56    (LL_ADC_SAMPLE_RATE_56)                     /*!< ADC conversion rate at F_ADC_CLK /  56 */
#define ADC_SAMPLE_RATE_60    (LL_ADC_SAMPLE_RATE_60)                     /*!< ADC conversion rate at F_ADC_CLK /  60 */
#define ADC_SAMPLE_RATE_64    (LL_ADC_SAMPLE_RATE_64)                     /*!< ADC conversion rate at F_ADC_CLK /  64 */
#define ADC_SAMPLE_RATE_68    (LL_ADC_SAMPLE_RATE_68)                     /*!< ADC conversion rate at F_ADC_CLK /  68 */
#define ADC_SAMPLE_RATE_72    (LL_ADC_SAMPLE_RATE_72)                     /*!< ADC conversion rate at F_ADC_CLK /  72 */
#define ADC_SAMPLE_RATE_76    (LL_ADC_SAMPLE_RATE_76)                     /*!< ADC conversion rate at F_ADC_CLK /  76 */
#define ADC_SAMPLE_RATE_80    (LL_ADC_SAMPLE_RATE_80)                     /*!< ADC conversion rate at F_ADC_CLK /  80 */
#define ADC_SAMPLE_RATE_84    (LL_ADC_SAMPLE_RATE_84)                     /*!< ADC conversion rate at F_ADC_CLK /  84 */
#define ADC_SAMPLE_RATE_88    (LL_ADC_SAMPLE_RATE_88)                     /*!< ADC conversion rate at F_ADC_CLK /  88 */
#define ADC_SAMPLE_RATE_92    (LL_ADC_SAMPLE_RATE_92)                     /*!< ADC conversion rate at F_ADC_CLK /  92 */
#define ADC_SAMPLE_RATE_96    (LL_ADC_SAMPLE_RATE_96)                     /*!< ADC conversion rate at F_ADC_CLK /  96 */
#define ADC_SAMPLE_RATE_100   (LL_ADC_SAMPLE_RATE_100)                    /*!< ADC conversion rate at F_ADC_CLK / 100 */
#define ADC_SAMPLE_RATE_104   (LL_ADC_SAMPLE_RATE_104)                    /*!< ADC conversion rate at F_ADC_CLK / 104 */
#define ADC_SAMPLE_RATE_108   (LL_ADC_SAMPLE_RATE_108)                    /*!< ADC conversion rate at F_ADC_CLK / 108 */
#define ADC_SAMPLE_RATE_112   (LL_ADC_SAMPLE_RATE_112)                    /*!< ADC conversion rate at F_ADC_CLK / 112 */
#define ADC_SAMPLE_RATE_116   (LL_ADC_SAMPLE_RATE_116)                    /*!< ADC conversion rate at F_ADC_CLK / 116 */
#define ADC_SAMPLE_RATE_120   (LL_ADC_SAMPLE_RATE_120)                    /*!< ADC conversion rate at F_ADC_CLK / 120 */
#define ADC_SAMPLE_RATE_124   (LL_ADC_SAMPLE_RATE_124)                    /*!< ADC conversion rate at F_ADC_CLK / 124 */
#define ADC_SAMPLE_RATE_128   (LL_ADC_SAMPLE_RATE_128)                    /*!< ADC conversion rate at F_ADC_CLK / 128 */
#define ADC_SAMPLE_RATE_132   (LL_ADC_SAMPLE_RATE_132)                    /*!< ADC conversion rate at F_ADC_CLK / 132 */
#define ADC_SAMPLE_RATE_136   (LL_ADC_SAMPLE_RATE_136)                    /*!< ADC conversion rate at F_ADC_CLK / 136 */
#define ADC_SAMPLE_RATE_140   (LL_ADC_SAMPLE_RATE_140)                    /*!< ADC conversion rate at F_ADC_CLK / 140 */
/**
  * @}
  */


/** @defgroup ADC_HAL_OP_MODE ADC operation modes definitions
  * @{
  */

#define ADC_OP_MODE_ADC      (LL_ADC_OP_MODE_ADC)    /*!< ADC operation mode ADC   */

/**
  * @}
  */

/** @defgroup ADC_HAL_EC_SEQ_RANKS  ADC Sequencer ranks
  * @{
  */

#define ADC_RANK_1                (LL_ADC_RANK_1)  /*!< ADC sequencer rank  1 */
#define ADC_RANK_2                (LL_ADC_RANK_2)  /*!< ADC sequencer rank  2 */
#define ADC_RANK_3                (LL_ADC_RANK_3)  /*!< ADC sequencer rank  3 */
#define ADC_RANK_4                (LL_ADC_RANK_4)  /*!< ADC sequencer rank  4 */
#define ADC_RANK_5                (LL_ADC_RANK_5)  /*!< ADC sequencer rank  5 */
#define ADC_RANK_6                (LL_ADC_RANK_6)  /*!< ADC sequencer rank  6 */
#define ADC_RANK_7                (LL_ADC_RANK_7)  /*!< ADC sequencer rank  7 */
#define ADC_RANK_8                (LL_ADC_RANK_8)  /*!< ADC sequencer rank  8 */
#define ADC_RANK_9                (LL_ADC_RANK_9)  /*!< ADC sequencer rank  9 */
#define ADC_RANK_10               (LL_ADC_RANK_10) /*!< ADC sequencer rank 10 */
#define ADC_RANK_11               (LL_ADC_RANK_11) /*!< ADC sequencer rank 11 */
#define ADC_RANK_12               (LL_ADC_RANK_12) /*!< ADC sequencer rank 12 */
#define ADC_RANK_13               (LL_ADC_RANK_13) /*!< ADC sequencer rank 13 */
#define ADC_RANK_14               (LL_ADC_RANK_14) /*!< ADC sequencer rank 14 */
#define ADC_RANK_15               (LL_ADC_RANK_15) /*!< ADC sequencer rank 15 */
#define ADC_RANK_16               (LL_ADC_RANK_16) /*!< ADC sequencer rank 16 */

/**
  * @}
  */


/** @defgroup ADC_HAL_INPUT_VOLTAGE_RANGE ADC input voltage range definitions
  * @{
  */

#define ADC_VIN_RANGE_1V2    (LL_ADC_VIN_RANGE_1V2)  /*!< ADC input voltage range up to 1.2 V */
#define ADC_VIN_RANGE_2V4    (LL_ADC_VIN_RANGE_2V4)  /*!< ADC input voltage range up to 2.4 V */
#define ADC_VIN_RANGE_3V6    (LL_ADC_VIN_RANGE_3V6)  /*!< ADC input voltage range up to 3.6 V */

/**
  * @}
  */


