stm32duino/Arduino_Core_STM32/system/Drivers/STM32WL3x_HAL_Driver/Inc/stm32wl3x_hal_adc.h
/** @defgroup ADC_HAL_DS_DATA_WIDTH ADC Down Sampler data width definitions
  * @{
  */

#define ADC_DS_DATA_WIDTH_12_BIT  (LL_ADC_DS_DATA_WIDTH_12_BIT)  /*!< ADC Down Sampler data width 12 bits */
#define ADC_DS_DATA_WIDTH_13_BIT  (LL_ADC_DS_DATA_WIDTH_13_BIT)  /*!< ADC Down Sampler data width 13 bits */
#define ADC_DS_DATA_WIDTH_14_BIT  (LL_ADC_DS_DATA_WIDTH_14_BIT)  /*!< ADC Down Sampler data width 14 bits */
#define ADC_DS_DATA_WIDTH_15_BIT  (LL_ADC_DS_DATA_WIDTH_15_BIT)  /*!< ADC Down Sampler data width 15 bits */
#define ADC_DS_DATA_WIDTH_16_BIT  (LL_ADC_DS_DATA_WIDTH_16_BIT)  /*!< ADC Down Sampler data width 16 bits */

/**
  * @}
  */


/** @defgroup ADC_HAL_DS_RATIO ADC Down Sampler ratio definitions
  * @{
  */

#define ADC_DS_RATIO_1    (LL_ADC_DS_RATIO_1)       /*!< ADC Down Sampler ratio 1, no down sampling (default) */
#define ADC_DS_RATIO_2    (LL_ADC_DS_RATIO_2)       /*!< ADC Down Sampler ratio 2                             */
#define ADC_DS_RATIO_4    (LL_ADC_DS_RATIO_4)       /*!< ADC Down Sampler ratio 4                             */
#define ADC_DS_RATIO_8    (LL_ADC_DS_RATIO_8)       /*!< ADC Down Sampler ratio 8                             */
#define ADC_DS_RATIO_16   (LL_ADC_DS_RATIO_16)      /*!< ADC Down Sampler ratio 16                            */
#define ADC_DS_RATIO_32   (LL_ADC_DS_RATIO_32)      /*!< ADC Down Sampler ratio 32                            */
#define ADC_DS_RATIO_64   (LL_ADC_DS_RATIO_64)      /*!< ADC Down Sampler ratio 64                            */
#define ADC_DS_RATIO_128  (LL_ADC_DS_RATIO_128)     /*!< ADC Down Sampler ratio 128                           */

/**
  * @}
  */


/** @defgroup ADC_HAL_CALIB_POINT ADC calibration points definitions
  * @{
  */

#define ADC_CALIB_POINT_1  (LL_ADC_CALIB_POINT_1)  /*!< ADC calibration point 1 */
#define ADC_CALIB_POINT_2  (LL_ADC_CALIB_POINT_2)  /*!< ADC calibration point 2 */
#define ADC_CALIB_POINT_3  (LL_ADC_CALIB_POINT_3)  /*!< ADC calibration point 3 */
#define ADC_CALIB_POINT_4  (LL_ADC_CALIB_POINT_4)  /*!< ADC calibration point 4 */
#define ADC_CALIB_NONE     (LL_ADC_CALIB_POINT_1   \
                            | LL_ADC_CALIB_POINT_2 \
                            | LL_ADC_CALIB_POINT_3 \
                            | LL_ADC_CALIB_POINT_4) /*!< ADC calibration point disabled: correction are left untouched
                                                       for the selected channel */

/**
  * @}
  */


/** @defgroup ADC_AWD_CHANNEL ADC watchdog channel selection for bit mask definitions
  * @{
  */

#define ADC_AWD_CH_VINM0      (LL_ADC_AWD_CH_VINM0)      /*!< ADC watchdog channel selection: VINM0 to ADC negative input  */
#define ADC_AWD_CH_VINM1      (LL_ADC_AWD_CH_VINM1)      /*!< ADC watchdog channel selection: VINM1 to ADC negative input  */
#define ADC_AWD_CH_VINM2      (LL_ADC_AWD_CH_VINM2)      /*!< ADC watchdog channel selection: VINM2 to ADC negative input  */
#define ADC_AWD_CH_VINM3      (LL_ADC_AWD_CH_VINM3)      /*!< ADC watchdog channel selection: VINM3 to ADC negative input  */
#define ADC_AWD_CH_VINP0      (LL_ADC_AWD_CH_VINP0)      /*!< ADC watchdog channel selection: VINP0 to ADC positive input  */
#define ADC_AWD_CH_VINP1      (LL_ADC_AWD_CH_VINP1)      /*!< ADC watchdog channel selection: VINP1 to ADC positive input  */
#define ADC_AWD_CH_VINP2      (LL_ADC_AWD_CH_VINP2)      /*!< ADC watchdog channel selection: VINP2 to ADC positive input  */
#define ADC_AWD_CH_VINP3      (LL_ADC_AWD_CH_VINP3)      /*!< ADC watchdog channel selection: VINP3 to ADC positive input  */
#define ADC_AWD_CH_MICROM     (LL_ADC_AWD_CH_MICROM)     /*!< ADC watchdog channel selection: MICROM to ADC negative input */
#define ADC_AWD_CH_MICROP     (LL_ADC_AWD_CH_MICROP)     /*!< ADC watchdog channel selection: MICROP to ADC positive input */
#define ADC_AWD_CH_VBAT       (LL_ADC_AWD_CH_VBAT)       /*!< ADC watchdog channel selection: VBAT to ADC negative input   */
#define ADC_AWD_CH_TEMPSENSOR (LL_ADC_AWD_CH_TEMPSENSOR) /*!< ADC watchdog channel selection: TEMPSENSOR to ADC positive input   */
#define ADC_AWD_CH_GND_NEG    (LL_ADC_AWD_CH_GND_NEG)    /*!< ADC watchdog channel selection: GND to ADC negative input    */
#define ADC_AWD_CH_GND_POS    (LL_ADC_AWD_CH_GND_POS)    /*!< ADC watchdog channel selection: GND to ADC positive input    */
#define ADC_AWD_CH_VDDA_NEG   (LL_ADC_AWD_CH_VDDA_NEG)   /*!< ADC watchdog channel selection: VDDA to ADC negative input   */
#define ADC_AWD_CH_VDDA_POS   (LL_ADC_AWD_CH_VDDA_POS)   /*!< ADC watchdog channel selection: VDDA to ADC positive input   */

/**
  * @}
  */

/** @defgroup ADC_AWD_EVENTTYPE ADC watchdog event type definitions
  * @{
  */

#define ADC_AWD_EVENT_POLLING       (0x00U)  /*!< ADC watchdog event type polling   */
#define ADC_AWD_EVENT_INTERRUPT     (0x01U)  /*!< ADC watchdog event type interrupt */

/**
  * @}
  */


/** @defgroup ADC_HAL_IRQ_STATUS_MASK ADC IRQ_STATUS register mask definitions
  * @{
  */
#define ADC_IRQ_FLAG_OVRDS   (LL_ADC_IRQ_FLAG_OVRDS) /*!< ADC IRQ flag OVRDS Down Sampler overrun */
#define ADC_IRQ_FLAG_AWD1    (LL_ADC_IRQ_FLAG_AWD1)  /*!< ADC IRQ flag AWD1 Analog watchdog event */
#define ADC_IRQ_FLAG_EOS     (LL_ADC_IRQ_FLAG_EOS)   /*!< ADC IRQ flag EOS  End of conversion Sequence */
#define ADC_IRQ_FLAG_EOC     (LL_ADC_IRQ_FLAG_EOC)   /*!< ADC IRQ flag EOC  End of conversion */
#define ADC_IRQ_FLAG_EODS    (LL_ADC_IRQ_FLAG_EODS)  /*!< ADC IRQ flag EODS End of Down Sampler conversion */

/**
  * @}
  */


/** @defgroup ADC_HAL_IRQ_STATUS_MASK ADC IRQ_STATUS register mask definitions
  * @{
  */
#define ADC_IRQ_FLAGS_MASK      (ADC_IRQ_FLAG_OVRDS | \
                                 ADC_IRQ_FLAG_AWD1  | \
                                 ADC_IRQ_FLAG_EOS   | \
                                 ADC_IRQ_FLAG_EOC   | \
                                 ADC_IRQ_FLAG_EODS)

/**
  * @}
  */


/** @defgroup ADC_HAL_IRQ_ENABLE ADC interrupts enable definitions
  * @{
  */
#define ADC_IRQ_EN_OVRDS   (LL_ADC_IRQ_EN_OVRDS)    /*!< ADC IRQ enable OVRDS */
#define ADC_IRQ_EN_AWD1    (LL_ADC_IRQ_EN_AWD1)     /*!< ADC IRQ enable AWD1   */
#define ADC_IRQ_EN_EOS     (LL_ADC_IRQ_EN_EOS)      /*!< ADC IRQ enable EOS   */
#define ADC_IRQ_EN_EOC     (LL_ADC_IRQ_EN_EOC)      /*!< ADC IRQ enable EOC   */
#define ADC_IRQ_EN_EODS    (LL_ADC_IRQ_EN_EODS)     /*!< ADC IRQ enable EODS  */

/**
  * @}
  */


