stm32duino/Arduino_Core_STM32/system/Drivers/STM32WL3x_HAL_Driver/Inc/stm32wl3x_hal_adc.h
/** @defgroup ADC_Private_Constants ADC Private Constants
  * @{
  */


/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/

/** @defgroup ADC_Exported_Macros ADC Exported Macros
  * @{
  */

/** @defgroup ADC_HAL_EM_HANDLE_IT_FLAG HAL ADC macro to manage HAL ADC handle,
  *           IT and flags.
  * @{
  */

/** @brief  Reset ADC handle state.
  * @param __HANDLE__ ADC handle
  * @retval None
  */
#if (USE_HAL_ADC_REGISTER_CALLBACKS == 1)
#define __HAL_ADC_RESET_HANDLE_STATE(__HANDLE__)     \
  do                                                 \
  {                                                  \
    (__HANDLE__)->State = HAL_ADC_STATE_RESET;       \
    (__HANDLE__)->MspInitCallback = NULL;            \
    (__HANDLE__)->MspDeInitCallback = NULL;          \
  } while(0)
#else
#define __HAL_ADC_RESET_HANDLE_STATE(__HANDLE__)     \
  ((__HANDLE__)->State = HAL_ADC_STATE_RESET)
#endif /* USE_HAL_ADC_REGISTER_CALLBACKS */


/**
  * @brief Enable ADC interrupt.
  * @param __HANDLE__ ADC handle
  * @param __INTERRUPT__ ADC Interrupt
  *        This parameter can be a combination of the following values:
  *            @arg @ref ADC_IRQ_EN_OVRFL  ADC Decimation Filter saturated interrupt source
  *            @arg @ref ADC_IRQ_EN_OVRDF  ADC Decimation Filter overrung interrupt source
  *            @arg @ref ADC_IRQ_EN_OVRDS  ADC Down Sampler overrun interrupt source
  *            @arg @ref ADC_IRQ_EN_AWD1   ADC Watchdog alert interrupt source
  *            @arg @ref ADC_IRQ_EN_EOC    ADC End of conversion interrupt source
  *            @arg @ref ADC_IRQ_EN_EOS    ADC End of conversion of a sequence interrupt source
  *            @arg @ref ADC_IRQ_EN_EODF   ADC End of conversion from Decimation Filter interrupt source
  *            @arg @ref ADC_IRQ_EN_EODS   ADC End of conversion from Down Sampler interrupt source
  * @retval None
  */
#define __HAL_ADC_ENABLE_IT(__HANDLE__, __INTERRUPT__)     LL_ADC_EnableIT((__HANDLE__)->Instance, __INTERRUPT__)


/**
  * @brief Disable ADC interrupt.
  * @param __HANDLE__ ADC handle
  * @param __INTERRUPT__ ADC Interrupt
  *        This parameter can be a combination of the following values:
  *            @arg @ref ADC_IRQ_EN_OVRFL  ADC Decimation Filter saturated interrupt source
  *            @arg @ref ADC_IRQ_EN_OVRDF  ADC Decimation Filter overrung interrupt source
  *            @arg @ref ADC_IRQ_EN_OVRDS  ADC Down Sampler overrun interrupt source
  *            @arg @ref ADC_IRQ_EN_AWD1   ADC Watchdog alert interrupt source
  *            @arg @ref ADC_IRQ_EN_EOC    ADC End of conversion interrupt source
  *            @arg @ref ADC_IRQ_EN_EOS    ADC End of conversion of a sequence interrupt source
  *            @arg @ref ADC_IRQ_EN_EODF   ADC End of conversion from Decimation Filter interrupt source
  *            @arg @ref ADC_IRQ_EN_EODS   ADC End of conversion from Down Sampler interrupt source
  * @retval None
  */
#define __HAL_ADC_DISABLE_IT(__HANDLE__, __INTERRUPT__)    LL_ADC_DisableIT((__HANDLE__)->Instance, __INTERRUPT__)


/** @brief  Checks if the specified ADC interrupt source is enabled or disabled.
  * @param __HANDLE__ ADC handle
  * @param __INTERRUPT__ ADC interrupt source to check
  *          This parameter can be one of the following values:
  *            @arg @ref ADC_IRQ_EN_OVRFL  ADC Decimation Filter saturated interrupt source
  *            @arg @ref ADC_IRQ_EN_OVRDF  ADC Decimation Filter overrung interrupt source
  *            @arg @ref ADC_IRQ_EN_OVRDS  ADC Down Sampler overrun interrupt source
  *            @arg @ref ADC_IRQ_EN_AWD1   ADC Watchdog alert interrupt source
  *            @arg @ref ADC_IRQ_EN_EOC    ADC End of conversion interrupt source
  *            @arg @ref ADC_IRQ_EN_EOS    ADC End of conversion of a sequence interrupt source
  *            @arg @ref ADC_IRQ_EN_EODF   ADC End of conversion from Decimation Filter interrupt source
  *            @arg @ref ADC_IRQ_EN_EODS   ADC End of conversion from Down Sampler interrupt source
  * @retval State of interruption (SET or RESET)
  */
#define __HAL_ADC_GET_IT_SOURCE(__HANDLE__, __INTERRUPT__)    LL_ADC_IsEnabledIT((__HANDLE__)->Instance, __INTERRUPT__)


/**
  * @brief Check whether the specified ADC flag is set or not.
  * @param __HANDLE__ ADC handle
  * @param __FLAG__ ADC flag
  *        This parameter can be one of the following values:
  *            @arg @ref ADC_IRQ_FLAG_OVRFL  ADC Decimation Filter saturated interrupt source
  *            @arg @ref ADC_IRQ_FLAG_OVRDF  ADC Decimation Filter overrung interrupt source
  *            @arg @ref ADC_IRQ_FLAG_OVRDS  ADC Down Sampler overrun interrupt source
  *            @arg @ref ADC_IRQ_FLAG_AWD1   ADC Watchdog alert interrupt source
  *            @arg @ref ADC_IRQ_FLAG_EOC    ADC End of conversion interrupt source
  *            @arg @ref ADC_IRQ_FLAG_EOS    ADC End of conversion of a sequence interrupt source
  *            @arg @ref ADC_IRQ_FLAG_EODF   ADC End of conversion from Decimation Filter interrupt source
  *            @arg @ref ADC_IRQ_FLAG_EODS   ADC End of conversion from Down Sampler interrupt source
  * @retval State of flag (TRUE or FALSE).
  */
#define __HAL_ADC_GET_FLAG(__HANDLE__, __FLAG__)    LL_ADC_IsActiveFlag((__HANDLE__)->Instance, __FLAG__)


/**
  * @brief Clear the specified ADC flag.
  * @param __HANDLE__ ADC handle
  * @param __FLAG__ ADC flag
  *        This parameter can be a combination of the following values:
  *            @arg @ref ADC_IRQ_FLAG_OVRFL  ADC Decimation Filter saturated interrupt source
  *            @arg @ref ADC_IRQ_FLAG_OVRDF  ADC Decimation Filter overrung interrupt source
  *            @arg @ref ADC_IRQ_FLAG_OVRDS  ADC Down Sampler overrun interrupt source
  *            @arg @ref ADC_IRQ_FLAG_AWD1   ADC Watchdog alert interrupt source
  *            @arg @ref ADC_IRQ_FLAG_EOC    ADC End of conversion interrupt source
  *            @arg @ref ADC_IRQ_FLAG_EOS    ADC End of conversion of a sequence interrupt source
  *            @arg @ref ADC_IRQ_FLAG_EODF   ADC End of conversion from Decimation Filter interrupt source
  *            @arg @ref ADC_IRQ_FLAG_EODS   ADC End of conversion from Down Sampler interrupt source
  * @retval None
  */
/* Note: bit cleared bit by writing 1 (writing 0 has no effect on any bit of register ISR) */
#define __HAL_ADC_CLEAR_FLAG(__HANDLE__, __FLAG__)    LL_ADC_ClearActiveFlags((__HANDLE__)->Instance, __FLAG__)


/**
  * @}
  */

