stm32duino/Arduino_Core_STM32/system/Drivers/STM32WL3x_HAL_Driver/Inc/stm32wl3x_hal_adc.h
/** @defgroup ADC_HAL_EM_HELPER_MACRO HAL ADC helper macro
  * @{
  */

/**
  * @brief  Helper macro to determine whether the selected channel
  *         corresponds to literal definitions of driver.
  * @param  __CHANNEL__ This parameter can be one of the following values:
  *         @arg @ref ADC_CHANNEL_VINM0
  *         @arg @ref ADC_CHANNEL_VINM1
  *         @arg @ref ADC_CHANNEL_VINM2
  *         @arg @ref ADC_CHANNEL_VINM3
  *         @arg @ref ADC_CHANNEL_VINP0
  *         @arg @ref ADC_CHANNEL_VINP1
  *         @arg @ref ADC_CHANNEL_VINP2
  *         @arg @ref ADC_CHANNEL_VINP3
  *         @arg @ref ADC_CHANNEL_VINP0_VINM0
  *         @arg @ref ADC_CHANNEL_VINP1_VINM1
  *         @arg @ref ADC_CHANNEL_VINP2_VINM2
  *         @arg @ref ADC_CHANNEL_VINP3_VINM3
  *         @arg @ref ADC_CHANNEL_VBAT
  *         @arg @ref ADC_CHANNEL_TEMPSENSOR
  * @retval Value "0" if the channel corresponds to a parameter definition of a ADC external channel
  *         (channel connected to a GPIO pin).
  *         Value "1" if the channel corresponds to a parameter definition of a ADC internal channel.
  */
#define __HAL_ADC_IS_CHANNEL_INTERNAL(__CHANNEL__)                             \
  __LL_ADC_IS_CHANNEL_INTERNAL((__CHANNEL__))

/**
  * @brief  Helper macro to convert the ADC conversion data from
  *         a resolution to another resolution.
  * @param  __DATA__ ADC conversion data to be converted
  * @param  __ADC_WIDTH_CURRENT__ Resolution of the data to be converted
  *         This parameter can be one of the following values:
  *         @arg @ref ADC_DS_DATA_WIDTH_12_BIT
  *         @arg @ref ADC_DS_DATA_WIDTH_13_BIT
  *         @arg @ref ADC_DS_DATA_WIDTH_14_BIT
  *         @arg @ref ADC_DS_DATA_WIDTH_15_BIT
  *         @arg @ref ADC_DS_DATA_WIDTH_16_BIT
  * @param  __ADC_WIDTH_TARGET__ Resolution of the data after conversion
  *         This parameter can be one of the following values:
  *         @arg @ref ADC_DS_DATA_WIDTH_12_BIT
  *         @arg @ref ADC_DS_DATA_WIDTH_13_BIT
  *         @arg @ref ADC_DS_DATA_WIDTH_14_BIT
  *         @arg @ref ADC_DS_DATA_WIDTH_15_BIT
  *         @arg @ref ADC_DS_DATA_WIDTH_16_BIT
  * @retval ADC conversion data to the requested resolution
  */
#define __HAL_ADC_CONVERT_DATA_RESOLUTION(__DATA__,\
                                          __ADC_WIDTH_CURRENT__,\
                                          __ADC_WIDTH_TARGET__)\
__LL_ADC_CONVERT_DATA_RESOLUTION((__DATA__),                                   \
                                 (__ADC_WIDTH_CURRENT__),                      \
                                 (__ADC_WIDTH_TARGET__))

/**
  * @brief  Helper macro to calculate the voltage (unit: mVolt)
  *         corresponding to a ADC conversion data (unit: digital value).
  * @param  __INPUT_VOLTAGE_RANGE__ Analog reference voltage (unit: mV)
  *         @arg @ref ADC_VIN_RANGE_3V6
  *         @arg @ref ADC_VIN_RANGE_2V4
  *         @arg @ref ADC_VIN_RANGE_1V2
  * @param  __ADC_DATA__ ADC conversion data (unit: digital value).
  * @param  __ADC_WIDTH__ This parameter can be one of the following values:
  *         @arg @ref ADC_DS_DATA_WIDTH_12_BIT
  *         @arg @ref ADC_DS_DATA_WIDTH_13_BIT
  *         @arg @ref ADC_DS_DATA_WIDTH_14_BIT
  *         @arg @ref ADC_DS_DATA_WIDTH_15_BIT
  *         @arg @ref ADC_DS_DATA_WIDTH_16_BIT
  * @retval ADC conversion data equivalent voltage value (unit: mVolt)
  */
#define __HAL_ADC_CALC_DATA_TO_VOLTAGE(__INPUT_VOLTAGE_RANGE__,\
                                       __ADC_DATA__,\
                                       __ADC_WIDTH__)\
__LL_ADC_CALC_DATA_TO_VOLTAGE((__INPUT_VOLTAGE_RANGE__),                       \
                              (__ADC_DATA__),                                  \
                              (__ADC_WIDTH__))

/**
  * @brief  Helper macro to calculate the voltage (unit: mVolt)
  *         corresponding to a ADC conversion data (unit: digital value)
  *         in differential ended mode.
  * @param  __INPUT_VOLTAGE_RANGE__ Analog reference voltage (unit: mV)
  *         @arg @ref ADC_VIN_RANGE_3V6
  *         @arg @ref ADC_VIN_RANGE_2V4
  *         @arg @ref ADC_VIN_RANGE_1V2
  * @param  __ADC_DATA__ ADC conversion data (unit: digital value).
  * @param  __ADC_WIDTH__ This parameter can be one of the following values:
  *         @arg @ref ADC_DS_DATA_WIDTH_12_BIT
  *         @arg @ref ADC_DS_DATA_WIDTH_13_BIT
  *         @arg @ref ADC_DS_DATA_WIDTH_14_BIT
  *         @arg @ref ADC_DS_DATA_WIDTH_15_BIT
  *         @arg @ref ADC_DS_DATA_WIDTH_16_BIT
  * @retval ADC conversion data equivalent voltage value (unit: mVolt)
  */
#define __HAL_ADC_CALC_DIFF_DATA_TO_VOLTAGE(__INPUT_VOLTAGE_RANGE__,\
                                            __ADC_DATA__,\
                                            __ADC_WIDTH__)\
__LL_ADC_CALC_DIFF_DATA_TO_VOLTAGE((__INPUT_VOLTAGE_RANGE__),                  \
                                   (__ADC_DATA__),                             \
                                   (__ADC_WIDTH__))

/**
  * @brief  Helper macro to calculate the temperature (unit: degree Celsius)
  *         from ADC conversion data of internal temperature sensor.
  * @note   Computation is using temperature sensor calibration values
  *         stored in system memory for each device during production.
  *         Caution: Calculation relevancy under reserve that calibration
  *                  parameters are correct (address and data).
  *                  To calculate temperature using temperature sensor
  *                  datasheet typical values (generic values less, therefore
  *                  less accurate than calibrated values),
  *                  use helper macro @ref __LL_ADC_CALC_TEMPERATURE_TYP_PARAMS().
  * @param  __TEMPSENSOR_ADC_DATA__ ADC conversion data of internal
  *                                 temperature sensor (unit: digital value).
  * @param  __ADC_WIDTH__ This parameter can be one of the following values:
  *         @arg @ref ADC_DS_DATA_WIDTH_12_BIT
  *         @arg @ref ADC_DS_DATA_WIDTH_13_BIT
  *         @arg @ref ADC_DS_DATA_WIDTH_14_BIT
  *         @arg @ref ADC_DS_DATA_WIDTH_15_BIT
  *         @arg @ref ADC_DS_DATA_WIDTH_16_BIT
  * @retval Temperature (unit: degree Celsius)
  */
#define __HAL_ADC_CALC_TEMPERATURE(__TEMPSENSOR_ADC_DATA__,\
                                   __ADC_WIDTH__)\
__LL_ADC_CALC_TEMPERATURE((__TEMPSENSOR_ADC_DATA__),                           \
                          (__ADC_WIDTH__))

/**
  * @brief  Helper macro to calculate the temperature (unit: degree Celsius)
  *         from ADC conversion data of internal temperature sensor.
  * @note   Computation is using temperature sensor typical values
  *         (refer to device datasheet).
  * @param  __TEMPSENSOR_ADC_DATA__      ADC conversion data of internal temperature sensor (unit: digital value).
  * @param  __ADC_WIDTH__ This parameter can be one of the following values:
  *         @arg @ref ADC_DS_DATA_WIDTH_12_BIT
  *         @arg @ref ADC_DS_DATA_WIDTH_13_BIT
  *         @arg @ref ADC_DS_DATA_WIDTH_14_BIT
  *         @arg @ref ADC_DS_DATA_WIDTH_15_BIT
  *         @arg @ref ADC_DS_DATA_WIDTH_16_BIT
  * @retval Temperature (unit: degree Celsius)
  */
#define __HAL_ADC_CALC_TEMPERATURE_TYP_PARAMS(__TEMPSENSOR_ADC_DATA__,\
                                              __ADC_WIDTH__)\
__LL_ADC_CALC_TEMPERATURE_TYP_PARAMS((__TEMPSENSOR_ADC_DATA__),                \
                                     (__ADC_WIDTH__))

/**
  * @}
  */

/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @addtogroup ADC_Exported_Functions
  * @{
  */

/** @addtogroup ADC_Exported_Functions_Group1
  * @brief    Initialization and Configuration functions
  * @{
  */

/* Initialization and de-initialization functions  ****************************/
HAL_StatusTypeDef HAL_ADC_Init(ADC_HandleTypeDef *hadc);
HAL_StatusTypeDef HAL_ADC_DeInit(ADC_HandleTypeDef *hadc);
void              HAL_ADC_MspInit(ADC_HandleTypeDef *hadc);
void              HAL_ADC_MspDeInit(ADC_HandleTypeDef *hadc);

